In [1]:
import pandas as pd
import matplotlib.pyplot as mpl

In [2]:
orders_data=pd.read_csv("orders.csv")

In [3]:
orders_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         10000 non-null  int64
 1   user_id          10000 non-null  int64
 2   restaurant_id    10000 non-null  int64
 3   order_date       10000 non-null  object
 4   total_amount     10000 non-null  float64
 5   restaurant_name  10000 non-null  object
dtypes: float64(1), int64(3), object(2)
memory usage: 468.9+ KB

In [4]:
orders_data.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name'],
      dtype='object')

In [5]:
orders_data['order_date']=pd.to_datetime(orders_data['order_date'],dayfirst=True)

In [38]:
user_data=pd.read_json("users.json")

In [9]:
orders_data

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,2023-02-18,842.97,New Foods Chinese
1,2,2693,309,2023-01-18,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,2023-07-15,163.93,Spice Kitchen Punjabi
3,4,319,224,2023-10-04,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,2023-12-25,1321.91,Royal Eatery South Indian
...,...,...,...,...,...,...
9995,9996,2528,249,2023-05-21,1211.96,Royal Kitchen North Indian
9996,9997,2867,267,2023-08-06,1188.05,Darbar Cafe Punjabi
9997,9998,522,420,2023-11-11,979.44,Ruchi Tiffins Chinese
9998,9999,319,492,2023-09-08,1105.93,Swagath Kitchen North Indian
9999,10000,457,439,2023-10-21,879.58,Classic Cafe Family Restaurant

In [34]:
import sqlite3

connection=sqlite3.connect("restaurants.db")
restaurants_data = pd.read_sql("SELECT * FROM restaurants", connection)

In [35]:
restaurants_data

     restaurant_id restaurant_name  cuisine  rating
0                1    Restaurant_1  Chinese     4.8
1                2    Restaurant_2   Indian     4.1
2                3    Restaurant_3  Mexican     4.3
3                4    Restaurant_4  Chinese     4.1
4                5    Restaurant_5  Chinese     4.8
..             ...             ...      ...     ...
495            496  Restaurant_496   Indian     3.1
496            497  Restaurant_497  Mexican     4.4
497            498  Restaurant_498  Chinese     3.9
498            499  Restaurant_499  Mexican     4.9
499            500  Restaurant_500  Chinese     3.2

[500 rows x 4 columns]

In [36]:
orders_data

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,2023-02-18,842.97,New Foods Chinese
1,2,2693,309,2023-01-18,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,2023-07-15,163.93,Spice Kitchen Punjabi
3,4,319,224,2023-10-04,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,2023-12-25,1321.91,Royal Eatery South Indian
...,...,...,...,...,...,...
9995,9996,2528,249,2023-05-21,1211.96,Royal Kitchen North Indian
9996,9997,2867,267,2023-08-06,1188.05,Darbar Cafe Punjabi
9997,9998,522,420,2023-11-11,979.44,Ruchi Tiffins Chinese
9998,9999,319,492,2023-09-08,1105.93,Swagath Kitchen North Indian
9999,10000,457,439,2023-10-21,879.58,Classic Cafe Family Restaurant

In [39]:
user_data

      user_id       name       city membership
0           1     User_1    Chennai    Regular
1           2     User_2       Pune       Gold
2           3     User_3  Bangalore       Gold
3           4     User_4  Bangalore    Regular
4           5     User_5       Pune       Gold
...       ...        ...        ...        ...
2995     2996  User_2996  Hyderabad       Gold
2996     2997  User_2997  Hyderabad    Regular
2997     2998  User_2998  Bangalore    Regular
2998     2999  User_2999       Pune    Regular
2999     3000  User_3000  Hyderabad       Gold

[3000 rows x 4 columns]

In [40]:
final_data=pd.merge(orders_data,restaurants_data,on="restaurant_id",how="left")

In [41]:
final_data

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,restaurant_name_y,cuisine,rating
0,1,2508,450,2023-02-18,842.97,New Foods Chinese,Restaurant_450,Mexican,3.2
1,2,2693,309,2023-01-18,546.68,Ruchi Curry House Multicuisine,Restaurant_309,Indian,4.5
2,3,2084,107,2023-07-15,163.93,Spice Kitchen Punjabi,Restaurant_107,Mexican,4.0
3,4,319,224,2023-10-04,1155.97,Darbar Kitchen Non-Veg,Restaurant_224,Chinese,4.8
4,5,1064,293,2023-12-25,1321.91,Royal Eatery South Indian,Restaurant_293,Italian,3.0
...,...,...,...,...,...,...,...,...,...
9995,9996,2528,249,2023-05-21,1211.96,Royal Kitchen North Indian,Restaurant_249,Italian,4.7
9996,9997,2867,267,2023-08-06,1188.05,Darbar Cafe Punjabi,Restaurant_267,Chinese,4.2
9997,9998,522,420,2023-11-11,979.44,Ruchi Tiffins Chinese,Restaurant_420,Italian,4.0
9998,9999,319,492,2023-09-08,1105.93,Swagath Kitchen North Indian,Restaurant_492,Italian,4.0
9999,10000,457,439,2023-10-21,879.58,Classic Cafe Family Restaurant,Restaurant_439,Mexican,3.1

In [42]:
final_data=pd.merge(final_data,user_data,on="user_id",how="left")

In [43]:
final_data

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,restaurant_name_y,cuisine,rating,name,city,membership
0,1,2508,450,2023-02-18,842.97,New Foods Chinese,Restaurant_450,Mexican,3.2,User_2508,Hyderabad,Regular
1,2,2693,309,2023-01-18,546.68,Ruchi Curry House Multicuisine,Restaurant_309,Indian,4.5,User_2693,Pune,Regular
2,3,2084,107,2023-07-15,163.93,Spice Kitchen Punjabi,Restaurant_107,Mexican,4.0,User_2084,Chennai,Gold
3,4,319,224,2023-10-04,1155.97,Darbar Kitchen Non-Veg,Restaurant_224,Chinese,4.8,User_319,Bangalore,Gold
4,5,1064,293,2023-12-25,1321.91,Royal Eatery South Indian,Restaurant_293,Italian,3.0,User_1064,Pune,Regular
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,2528,249,2023-05-21,1211.96,Royal Kitchen North Indian,Restaurant_249,Italian,4.7,User_2528,Hyderabad,Gold
9996,9997,2867,267,2023-08-06,1188.05,Darbar Cafe Punjabi,Restaurant_267,Chinese,4.2,User_2867,Bangalore,Regular
9997,9998,522,420,2023-11-11,979.44,Ruchi Tiffins Chinese,Restaurant_420,Italian,4.0,User_522,Bangalore,Gold
9998,9999,319,492,2023-09-08,1105.93,Swagath Kitchen North Indian,Restaurant_492,Italian,4.0,User_319,Bangalore,Gold
9999,10000,457,439,2023-10-21,879.58,Classic Cafe Family Restaurant,Restaurant_439,Mexican,3.1,User_457,Chennai,Regular

In [46]:
final_data.to_csv("final_food_delivery_dataset.csv",index=False)

### Which city has the highest total revenue (total_amount) from Gold members?

In [58]:
final_data[final_data['membership']=="Gold"].groupby("city")["total_amount"].sum().sort_values(ascending=False)

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

### Which cuisine has the highest average order value across all orders?

In [60]:
final_data.groupby("cuisine")["total_amount"].mean().sort_values(ascending=False)

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

### How many distinct users placed orders worth more than ₹1000 in total (sum of all their orders)?

In [86]:
distint_users = (final_data.groupby("user_id")["total_amount"].sum())

In [87]:
count=0
for x in distint_users:
    if(x>1000):
        count+=1;

In [88]:
count

2544

### Which restaurant rating range generated the highest total revenue?

In [91]:
final_data.groupby("rating")["total_amount"].mean().sort_values(ascending=False)

rating
3.6    846.775449
3.8    830.745000
4.2    826.533320
4.4    820.561374
4.6    819.616479
3.2    819.554274
4.0    813.967826
3.1    809.970657
4.3    809.208851
3.5    805.106187
4.7    803.670869
4.5    795.759186
4.8    791.465355
3.7    790.071180
3.3    785.320981
4.1    783.643724
3.4    776.125091
3.9    775.160698
3.0    770.447523
4.9    768.860345
5.0    760.411762
Name: total_amount, dtype: float64

### Among Gold members, which city has the highest average order value?

In [92]:
final_data[final_data['membership']=="Gold"].groupby("city")["total_amount"].mean().sort_values(ascending=False)

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

### Which cuisine has the lowest number of distinct restaurants but still contributes significant revenue?

In [97]:
pd.pivot_table(final_data,index="cuisine",values=["restaurant_id", "total_amount"],aggfunc={"restaurant_id": pd.Series.nunique,"total_amount": "sum"})

         restaurant_id  total_amount
cuisine
Chinese            120    1930504.65
Indian             126    1971412.58
Italian            126    2024203.80
Mexican            128    2085503.09

### What percentage of total orders were placed by Gold members? (Rounded to nearest integer)

In [104]:
final_data.groupby("membership")["total_amount"].sum().sort_values(ascending=False).iloc[1]/(final_data['total_amount'].sum())

np.float64(0.49619962575078974)

### Which restaurant has the highest average order value but less than 20 total orders?

In [137]:
order_value=final_data.groupby("restaurant_name_x") .agg(total_orders=("order_id", "count"), avg=("total_amount", "mean"))

In [143]:
order_value.loc[["Grand Cafe Punjabi","Grand Restaurant South Indian","Ruchi Mess Multicuisine","Ruchi Foods Chinese"]]

                               total_orders         avg
restaurant_name_x
Grand Cafe Punjabi                       32  765.409063
Grand Restaurant South Indian            29  842.567586
Ruchi Mess Multicuisine                  40  851.226250
Ruchi Foods Chinese                      19  686.603158

### Which combination contributes the highest revenue?

In [156]:
final_data.groupby(["membership", "cuisine"])["total_amount"] .sum() .sort_values(ascending=False)

membership  cuisine
Regular     Mexican    1072943.30
            Italian    1018424.75
Gold        Mexican    1012559.79
            Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
            Chinese     977713.74
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

### During which quarter of the year is the total revenue highest?

In [166]:
final_data.groupby(final_data["order_date"].dt.to_period("Q"))["total_amount"].sum().idxmax()

Period('2023Q3', 'Q-DEC')

### How many total orders were placed by users with Gold membership?

In [167]:
final_data.groupby("membership")["total_amount"].sum()

membership
Gold       3975364.89
Regular    4036259.23
Name: total_amount, dtype: float64

### What is the total revenue (rounded to nearest integer) generated from orders placed in Hyderabad city?

In [169]:
final_data.groupby("city")["total_amount"].sum().sort_values(ascending=False)

city
Bangalore    2206946.58
Chennai      1990513.03
Pune         1924797.93
Hyderabad    1889366.58
Name: total_amount, dtype: float64

In [171]:
final_data['user_id'].nunique()

2883

In [174]:
round(final_data[final_data['membership'] == 'Gold']['total_amount'].mean(),2)

np.float64(797.15)

In [175]:
final_data[final_data['rating'] >= 4.5]['order_id'].count()

np.int64(3374)

In [129]:
final_data[final_data['restaurant_name_y']=="Restaurant_294"]

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,restaurant_name_y,cuisine,rating,name,city,membership
1407,1408,2895,294,2023-08-22,817.71,Hotel Dhaba Multicuisine,Restaurant_294,Italian,3.1,User_2895,Chennai,Gold
1643,1644,1363,294,2023-09-29,1327.91,Hotel Dhaba Multicuisine,Restaurant_294,Italian,3.1,User_1363,Bangalore,Gold
2426,2427,2944,294,2023-08-30,629.97,Hotel Dhaba Multicuisine,Restaurant_294,Italian,3.1,User_2944,Hyderabad,Gold
3174,3175,315,294,2023-11-20,1004.28,Hotel Dhaba Multicuisine,Restaurant_294,Italian,3.1,User_315,Chennai,Gold
3243,3244,2100,294,2023-03-08,1189.93,Hotel Dhaba Multicuisine,Restaurant_294,Italian,3.1,User_2100,Hyderabad,Regular
4007,4008,2137,294,2023-02-13,1082.37,Hotel Dhaba Multicuisine,Restaurant_294,Italian,3.1,User_2137,Pune,Gold
4999,5000,1478,294,2023-10-24,943.66,Hotel Dhaba Multicuisine,Restaurant_294,Italian,3.1,User_1478,Pune,Gold
5157,5158,701,294,2023-07-08,1290.51,Hotel Dhaba Multicuisine,Restaurant_294,Italian,3.1,User_701,Hyderabad,Regular
5718,5719,1223,294,2023-10-13,1400.13,Hotel Dhaba Multicuisine,Restaurant_294,Italian,3.1,User_1223,Chennai,Regular
5851,5852,2089,294,2023-11-18,1175.40,Hotel Dhaba Multicuisine,Restaurant_294,Italian,3.1,User_2089,Hyderabad,Gold
6155,6156,545,294,2024-01-01,1070.86,Hotel Dhaba Multicuisine,Restaurant_294,Italian,3.1,User_545,Pune,Regular
8840,8841,2381,294,2023-12-04,631.82,Hotel Dhaba Multicuisine,Restaurant_294,Italian,3.1,User_2381,Pune,Regular
9439,9440,2681,294,2023-11-12,958.34,Hotel Dhaba Multicuisine,Restaurant_294,Italian,3.1,User_2681,Chennai,Gold